temp/_site/2012/09/03/baking_pi_intro/index.html
<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
        <title>Baking Pi - Operating Systems Development</title>
        <meta name="viewport" content="width=device-width">

        <!-- syntax highlighting CSS -->
        <link rel="stylesheet" href="/css/syntax.css">

        <!-- Custom CSS -->
        <link rel="stylesheet" href="/css/main.css">

        <!-- Personal CSS -->
        <link rel="stylesheet" href="/css/personal.css">
    </head>
    <body>

        <div class="container">
          <div class="site">
            <div class="header">
              <h1 class="title"><a href="/">K.I.S.S</a></h1>
              <a class="extra" href="/">home</a>
              <a class="extra" href="/about.html">about</a>
              <a class="extra" href="/atom.xml">RSS</a>
            </div>

                

<h2>Baking Pi - Operating Systems Development</h2>

<p class="meta">03 Sep 2012</p>

<div class="post">
  <div id="outline-container-1" class="outline-2">
<h2 id="sec-1">介绍<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup></h2>
<div class="outline-text-2" id="text-1">

<p>欢迎来到本课程,课程作者为<a href="#awc32-cam.ac.uk">Alex Chadwick.</a>
</p>
<p>
这个网站旨在帮助你完成在Raspberry Pi上进行一个基本的操作系统的开发.目标读者是16岁以上,当然更小的读者也可以,如果可以有其他人的帮助当然更好.课程目前还在进展中,随时会有新加入的内容.
</p>
<p>
本课程主要内容是利用汇编语言进行操作系统开发.设计之初就考虑到了没有操作系统开发和汇编语言背景的读者,因此无需上述的背景知识.当然如果有编程经验的话,更是锦上添花.整个课程如下面的表格,被划分为多个课时.每个课时都会包括一些理论的介绍,实践训练和完整的答案.
</p>
<p>
本课程不会涉及到操作系统开发的细节,只是完成开发最基本的功能,而且各个主要部分之间也相对分离.在最后,读者有望可以对操作系统有一定的了解,并且有足够的能力将课程中所有的部分组合在一起,形成一个完整的有一定功能的操作系统.课程涉及的内容并不多,但是读者如果有心,仍有很多自己可以发挥的地方.譬如,完成课程后,完成函数的那一课后，你可以考虑出更好的汇编代码,或者是在有关图形操作的课程后考虑下3D操作系统.别忘了,这是操作系统课程,因此你可以随意创造出你自己的心目中的东西.一旦你有任何新想法,尝试一下不会有坏处.计算机科学还是个很年轻的领域,很多方面都亟待发掘.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">基本要求</h3>
<div class="outline-text-3" id="text-1-1">

<p>要想完成这门课程,你得准备好一个 Raspberry Pi,兼容的SD卡,以及电源,还有用于开发的电脑,操作系统可以是linux, Windows, Mac OS X,电脑要可以安装软件和读写SD卡.如果有个可以连上 Raspberry Pi的显示器当然更好,不过不是必须.
</p>
<p>
软件上,你需要目标平台是ARMv6的GNU开源工具链,<a href="http://www.cl.cam.ac.uk/freshers/raspberrypi/tutorials/os/downloads.html">下载</a> 页面上有他们的链接,还有所有练习的参考答案.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">课时安排</h3>
<div class="outline-text-3" id="text-1-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">编号</th><th scope="col" class="left">课程名称</th><th scope="col" class="left">描述</th></tr>
</thead>
<tbody>
<tr><td class="right">0</td><td class="left">介绍</td><td class="left">这一部分没有实质的内容,主要是介绍作系统和汇编代码的基本概念和其他重要的基础知识.如果急于进入课程的主体,可以选择跳过这一课程</td></tr>
<tr><td class="right"></td><td class="left">OK LED系列</td><td class="left">(难度简单)</td></tr>
<tr><td class="right">1</td><td class="left">OK01</td><td class="left">说明最基本的起步和怎样打开Raspberry Pi上的'OK' LED灯,灯的位置在RCA和USB接口附近</td></tr>
<tr><td class="right">2</td><td class="left">OK02</td><td class="left">基于OK01,内容是让'OK' LED可以重复关闭和开启</td></tr>
<tr><td class="right">3</td><td class="left">OK03</td><td class="left">基于OK02,讲解如何使用汇编中的函数提高代码的复用性和可读性</td></tr>
<tr><td class="right">4</td><td class="left">OK04</td><td class="left">基于OK03,如何利用定时器让LED灯可以精确的闪烁</td></tr>
<tr><td class="right">5</td><td class="left">OK05</td><td class="left">基于OK04,让LED发出SOS的摩斯码(&hellip;&mdash;&hellip;)</td></tr>
<tr><td class="right"></td><td class="left">Screen系列</td><td class="left">(高级部分)</td></tr>
<tr><td class="right">6</td><td class="left">Screen01</td><td class="left">介绍有关图形学的基本理论,然后实践之,在显示器或者电视上显示渐变图案</td></tr>
<tr><td class="right">7</td><td class="left">Screen02</td><td class="left">基于Screen01,教授如何画线以及生成一个伪随机数的方法</td></tr>
<tr><td class="right">8</td><td class="left">Screen03</td><td class="left">基于Screen02,教授如何打印文本到显示器上,并且介绍内核命令行的概念</td></tr>
<tr><td class="right">9</td><td class="left">Screen04</td><td class="left">基于Screen03,教授如何处理文本在屏幕上显示计算值</td></tr>
<tr><td class="right"></td><td class="left">Input系列</td><td class="left">(高级部分)</td></tr>
<tr><td class="right">10</td><td class="left">Input01</td><td class="left">介绍有关驱动,链接程序还有键盘的概念.然后实现打印输入的字符到显示器上的功能</td></tr>
<tr><td class="right">11</td><td class="left">Input02</td><td class="left">基于Input01,教授如何构建操作系统的命令行接口</td></tr>
</tbody>
</table>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> 该系列翻译自<a href="http://www.cl.cam.ac.uk/freshers/raspberrypi/tutorials/os/">http://www.cl.cam.ac.uk/freshers/raspberrypi/tutorials/os/</a> ,根据其协议使用版权 <a href="http://creativecommons.org/licenses/by-sa/3.0/deed.en_GB">Creative Commons Attribution-ShareAlike 3.0 Unported License.</a>
</p>




</div>
</div>
</div>

</div>
</div>

  <div>
    <div id="disqus_thread"></div>
<script type="text/javascript">
  
  var disqus_developer = 1;
  
  var disqus_shortname = 'qinjian623-blogger';
  // required    : replace example with your forum shortname
  
  /* * * DON'T EDIT BELOW THIS LINE * * */
  (function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
<noscript>
  Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a>
</noscript>  

  </div>
</div>


            <div class="footer">
            </div>
          </div>
        </div> <!-- /container -->

        <footer class="footer">
          <p>&copy; Qin Jian 2012 如无特殊说明,所有产生内容默认<a href="http://creativecommons.org/licenses/by-sa/2.5/cn">CC知识共享署名-相同方式</a>
          </p>
        </footer>
        
         <script type="text/javascript">
   var _gaq = _gaq || [];
   _gaq.push(['_setAccount', 'UA-34189274-1']);
   _gaq.push(['_trackPageview']);

   (function() {
     var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
     ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
     var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
   })();
 </script>    

    </body>
</html>
